import React from 'react'
import './Politika.css'

const Politika = () => {
  return (
    <section className="policy-section">
      <div className="policy-container">
        <div className="policy-hero">
          <h1 className="policy-main-title">Политика конфиденциальности</h1>
          <p className="policy-subtitle">Ваши данные под надежной защитой.</p>
        </div>

        <div className="policy-content">
          <p>
            Настоящая Политика конфиденциальности и обработки персональных
            данных (далее – Политика конфиденциальности) регулирует порядок
            обработки и использования персональных и иных данных, собранных
            интернет-магазином «MONKAL» (далее – MONKAL) с помощью
            интернет-ресурса (далее – Сайт), мобильного приложения MONKAL и
            связанных с ними услуг и инструментов на Сайте.
          </p>
          <p>
            Во всех указанных случаях MONKAL обрабатывает персональные данные
            пользователей исключительно в рамках требований законодательства
            Кыргызской Республики «О персональных данных и их защите» (далее –
            Закон), а также международных договоров, ратифицированных Кыргызской
            Республикой.
          </p>

          <h2>1. ТЕРМИНЫ И ОПРЕДЕЛЕНИЯ</h2>
          <ul>
            <li>
              <strong>Сайт</strong> – интернет-ресурс, расположенный в сети
              Интернет. Все исключительные права на Сайт и его отдельные
              элементы (включая программное обеспечение, дизайн) принадлежат
              MONKAL в полном объеме.
            </li>
            <li>
              <strong>Персональные данные</strong> — персональные данные
              Пользователя, которые Пользователь предоставляет самостоятельно
              при регистрации или в процессе использования функционала Сайта.
            </li>
            <li>
              <strong>Пользователь Сайта (далее – Пользователь)</strong> – лицо,
              имеющее доступ к Сайту, посредством сети Интернет и использующее
              Сайт интернет-магазина.
            </li>
            <li>
              <strong>Обработка персональных данных</strong> – действие или
              совокупность действий, совершаемых с использованием средств
              автоматизации или без использования таких средств, направленные на
              накопление, хранение, изменение, дополнение, использование, и
              другие действия с персональными данными.
            </li>
            <li>
              <strong>Конфиденциальность персональных данных</strong> –
              обязательное для соблюдения требование не допускать их
              распространения без согласия субъекта персональных данных или
              наличия иного законного основания.
            </li>
          </ul>

          <h2>2. ОБЩИЕ ПОЛОЖЕНИЯ</h2>
          <p>
            2.1. Использование Пользователем Сайта означает согласие с настоящей
            Политикой конфиденциальности и условиями обработки персональных
            данных Пользователя.
          </p>
          <p>
            2.2. В случае несогласия с условиями Политики конфиденциальности
            Пользователь должен прекратить использование Сайта.
          </p>

          <h2>3. ПРЕДМЕТ ПОЛИТИКИ КОНФИДЕНЦИАЛЬНОСТИ</h2>
          <p>
            3.1. Настоящая Политика конфиденциальности устанавливает
            обязательства MONKAL по неразглашению и обеспечению режима защиты
            конфиденциальности персональных данных, которые Пользователь
            предоставляет при регистрации на Сайте или при оформлении заказа.
          </p>
          <p>
            3.2. Персональные данные, разрешённые к обработке, предоставляются
            Пользователем и включают в себя:
          </p>
          <ul>
            <li>Фамилию, имя и отчество Пользователя;</li>
            <li>Контактный телефон Пользователя;</li>
            <li>Адрес электронной почты;</li>
          </ul>

          <h2>4. ЦЕЛИ СБОРА ПЕРСОНАЛЬНОЙ ИНФОРМАЦИИ</h2>
          <p>
            4.1. Персональные данные Пользователя MONKAL может использовать в
            целях идентификации Пользователя, установления обратной связи,
            уведомления о состоянии заказа, обработки платежей и предоставления
            эффективной клиентской поддержки.
          </p>

          <h2>5. СПОСОБЫ И СРОКИ ОБРАБОТКИ</h2>
          <p>
            5.1. Обработка персональных данных Пользователя осуществляется без
            ограничения срока, любым законным способом.
          </p>
          <p>
            5.2. Пользователь соглашается с тем, что MONKAL вправе передавать
            персональные данные третьим лицам (курьерским службам, организациям
            почтовой связи) исключительно в целях выполнения заказа
            Пользователя.
          </p>

          <h2>6. ПРАВА И ОБЯЗАННОСТИ СТОРОН</h2>
          <p>
            6.1. Пользователь обязан предоставлять корректную информацию о
            персональных данных и обновлять ее в случае изменения.
          </p>
          <p>
            6.2.MONKAL обязано использовать полученную информацию исключительно
            для целей, указанных в разделе 4 настоящей Политики, и обеспечивать
            хранение конфиденциальной информации в тайне.
          </p>

          <h2>7. ЗАКЛЮЧИТЕЛЬНЫЕ ПОЛОЖЕНИЯ</h2>
          <p>
            9.1. К настоящей Политике конфиденциальности применяется действующее
            законодательство Кыргызской Республики.
          </p>
          <p>
            9.2. MONKAL вправе вносить изменения в настоящую Политику
            конфиденциальности без согласия Пользователя. Новая редакция
            вступает в силу с момента ее размещения на Сайте.
          </p>
        </div>
      </div>
    </section>
  )
}

export default Politika
